USE Expert_system;

INSERT INTO programming_languages(
	id_number,
	programming_language,
	help)
VALUES ('13', 'C#', N'ООП-язык, позволяющий легко реализовать почти любую логику'),
('141', '1C', N'1С - отечественный продукт в корпоративной сфере, имеющий достойную репутацию'),
('21', 'ASM, machine code', N'Язык, на котором можно делать все, что захотите, вплоть до прямого заполнения регистров'),
('00010', 'JavaScript', N'Отличный язык для web-разработки'),
('100', 'MATLAB', N'Подходит для реализации различных вычислений'),
('101', 'Fortran', N'Старый, но верный язык низкого уровня'),
('111', 'C# + Unity', N'Боевая парочка для gamedev''а - разработки игр'),
('110', 'C++ + Unreal Engine', N'Движок Unreal Engine позволяет оптимизировать вычисления на графическом процессоре и делать приложения со сложной графикой'),
('121', 'C++', N'Сложный, но универсальный язык как для учебы, так и для промышленной разработки'),
('200', 'C', N'Отец целого семейства языков'),
('2011', 'Java', N'Неоднозначный, но практически ходовой язык'),
('0010', 'HTML + CSS', N'HTML с применением CSS позволяет разбить страницу на элементы, с каждым из которых можно работать отдельно'),
('0011', 'HTML', N'Фундаментальный язык написания веб-страниц'),
('0100', 'Java, Asp.NET', N'Набор инструментов для продвинутого разработчика веба'),
('1201', 'Python', N'В настоящее время один из самых востребованных языков'),
('1200', 'Pascal, Delphi', N'Простые, древние языки, с которых отлично начинать знакомство с программированием'),
('01111', 'PHP', N'Это распространенный язык программирования общего назначения с открытым исходным кодом. 
PHP сконструирован специально для ведения Web-разработок и его код может внедряться непосредственно в HTML.'),
('01110', 'TypeScript', N'TypeScript — это расширенная версия JavaScript, главной целью которого является упрощение разработки крупных JS-приложений.'),
('01100', 'JS + React', N'Бомбовый набор для клиент-серверного приложения, использующийся повсеместно'),
('01101', 'Ruby', N'Динамический язык программирования с открытым исходным кодом с упором на простоту и продуктивность.
Он обладает элегантным синтаксисом, который приятно читать и легко писать.'),
('01010', 'Haskell', N'Cтандартизированный чистый функциональный язык программирования общего назначения. 
Является одним из самых распространённых языков программирования с поддержкой отложенных вычислений.'),
('01011', 'Rust', N'Rust отлично подходит как для стартапов, так и для больших компаний, как для встраиваемых устройств, так и для масштабируемых web-сервисов.'),
('140', 'ABAP', N'Проприетарный внутренний язык программирования высокого уровня немецкой софтверной компании SAP'),
('0000', 'Perl', N'Высокоуровневый интерпретируемый динамический язык программирования общего назначения, созданный Ларри Уоллом, лингвистом по образованию.'),
('00011', 'Lua', N'Скриптовый язык программирования, разработанный в подразделении Tecgraf. 
Интерпретатор языка является свободно распространяемым, с открытыми исходными текстами на языке Си.'),
('30', 'Swift', N'Swift — это надёжный и интуитивно понятный язык программирования от Apple, 
при помощи которого можно создавать приложения для iOS, Mac, Apple TV и Apple Watch.'),
('31', 'Kotlin', N'Статически типизированный, объектно-ориентированный язык программирования, 
работающий поверх Java Virtual Machine и разрабатываемый компанией JetBrains.'),
('2010', 'Scala', N'Мультипарадигмальный язык программирования, спроектированный кратким и типобезопасным для простого и быстрого создания компонентного программного обеспечения, 
сочетающий возможности функционального и объектно-ориентированного программирования.');